<template>
    <div class="pt-12 bg-white ">
        <div class="xl:flex lg:flex hidden flex-row  justify-between">
            <div class="w-1/3 xl:ml-16 lg:ml-16 ml-6 mb-6 gap-6 text-gray-400 mt-2 flex flex-col">
                <p class="xl:flex lg:flex hidden xl:text-sm lg:text-sm">
                    Данный сайт разработан в рамках проекта: «Активизация экономического восстановления от последствий
                    пандемии
                    COVID-19
                    посредством улучшения благосостояния, возможностей для трудоустройства и продвижения регионального
                    сотрудничества в
                    ферганской долине» финансируемого Правительством Российской Федерации
                </p>
                <p style="font-size: 7px;" class="xl:hidden lg:hidden block ">
                    Данный сайт разработан в рамках проекта: «Активизация экономического восстановления от последствий
                    пандемии
                    COVID-19
                    посредством улучшения благосостояния, возможностей для трудоустройства и продвижения регионального
                    сотрудничества в
                    ферганской долине» финансируемого Правительством Российской Федерации
                </p>
                <div class="flex flex-row justify-end">
                    <div class="flex gap-2 ">
                        <img src="../assets/footer1.png" alt="">
                        <img src="../assets/footer2.png" alt="">
                    </div>
                </div>
            </div>

            <div class="flex border-r-4 rounded-2xl border-black h-48 mx-3"></div>
            <div class="w-1/3 flex justify-center flex-col mb-8 items-center">

                <svg class="ml-4" width="38" height="38" viewBox="0 0 38 38" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g id="Group 1">
                        <g id="g30">
                            <g id="path32">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M37 1.12305C17.5048 1.12685 7.46519 1.14961 6.88125 1.19134C6.2973 1.23307 5.65079 1.37905 4.94171 1.6293C4.23261 1.87956 3.69037 2.21324 3.31498 2.63035C2.93958 3.04745 2.58503 3.50628 2.25134 4.00682C1.91765 4.50735 1.64654 5.13302 1.438 5.88382C1.22945 6.63462 1.10432 7.46883 1.06259 8.38647C1.02086 9.30409 1 18.7989 1 36.871C2.31582 36.9071 3.50749 36.779 4.57502 36.4866C5.64254 36.1943 6.43978 35.7966 6.96674 35.2936C7.49369 34.7906 7.90739 34.1984 8.20784 33.5169C8.50829 32.8353 8.68076 32.0464 8.72524 31.15C8.76973 30.2537 8.77003 27.4693 8.72614 22.7969L31.2992 22.932C32.3224 22.6375 33.0644 22.383 33.5253 22.1684C33.9862 21.9537 34.4575 21.6052 34.9392 21.1228C35.4208 20.6404 35.8285 20.0447 36.1622 19.3356C36.4959 18.6265 36.7706 17.253 36.9865 15.2151L8.75816 15.1436L8.76654 8.72911L31.445 8.73139C33.1453 8.4885 34.3073 8.14339 34.9311 7.69608C35.5548 7.24877 36.0028 6.6734 36.2749 5.96997C36.5471 5.26654 36.7598 4.19505 36.913 2.75549"
                                    fill="#151616" />
                                <path
                                    d="M37 1.12305C17.5048 1.12685 7.46519 1.14961 6.88125 1.19134C6.2973 1.23307 5.65079 1.37905 4.94171 1.6293C4.23261 1.87956 3.69037 2.21324 3.31498 2.63035C2.93958 3.04745 2.58503 3.50628 2.25134 4.00682C1.91765 4.50735 1.64654 5.13302 1.438 5.88382C1.22945 6.63462 1.10432 7.46883 1.06259 8.38647C1.02086 9.30409 1 18.7989 1 36.871C2.31582 36.9071 3.50749 36.779 4.57502 36.4866C5.64254 36.1943 6.43978 35.7966 6.96674 35.2936C7.49369 34.7906 7.90739 34.1984 8.20784 33.5169C8.50829 32.8353 8.68076 32.0464 8.72524 31.15C8.76973 30.2537 8.77003 27.4693 8.72614 22.7969L31.2992 22.932C32.3224 22.6375 33.0644 22.383 33.5253 22.1684C33.9862 21.9537 34.4575 21.6052 34.9392 21.1228C35.4208 20.6404 35.8285 20.0447 36.1622 19.3356C36.4959 18.6265 36.7706 17.253 36.9865 15.2151L8.75816 15.1436L8.76654 8.72911L31.445 8.73139C33.1453 8.4885 34.3073 8.14339 34.9311 7.69608C35.5548 7.24877 36.0028 6.6734 36.2749 5.96997C36.5471 5.26654 36.7598 4.19505 36.913 2.75549"
                                    stroke="#151616" stroke-width="0.5669" />
                            </g>
                        </g>
                    </g>
                </svg>
                <div class="flex flex-row gap-4">
                    <div class="w-12 h-12 flex items-center justify-center p-2 rounded-full border mt-6 border-yellow-500">
                        <a href="https://instagram.com/poyafzol?igshid=OGQ5ZDc2ODk2ZA==">
                            <svg width="19" height="20" viewBox="0 0 12 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="instagram 1" clip-path="url(#clip0_220_4909)">
                                    <g id="Group">
                                        <path id="Vector"
                                            d="M6 1.95795C7.602 1.95795 7.792 1.96395 8.4245 1.99295C9.0785 2.02295 9.752 2.17195 10.2285 2.64845C10.7095 3.12945 10.854 3.79645 10.884 4.45245C10.913 5.08495 10.919 5.27495 10.919 6.87695C10.919 8.47895 10.913 8.66895 10.884 9.30145C10.8545 9.95195 10.702 10.632 10.2285 11.1055C9.7475 11.5865 9.081 11.731 8.4245 11.761C7.792 11.79 7.602 11.796 6 11.796C4.398 11.796 4.208 11.79 3.5755 11.761C2.93 11.7315 2.241 11.5755 1.7715 11.1055C1.293 10.627 1.146 9.95345 1.116 9.30145C1.087 8.66895 1.081 8.47895 1.081 6.87695C1.081 5.27495 1.087 5.08495 1.116 4.45245C1.1455 3.80445 1.2995 3.12045 1.7715 2.64845C2.2515 2.16845 2.921 2.02295 3.5755 1.99295C4.208 1.96395 4.398 1.95795 6 1.95795ZM6 0.876953C4.3705 0.876953 4.166 0.883953 3.526 0.912953C2.5985 0.955453 1.6775 1.21345 1.007 1.88395C0.334 2.55695 0.0785 3.47595 0.036 4.40295C0.007 5.04295 0 5.24745 0 6.87695C0 8.50645 0.007 8.71095 0.036 9.35095C0.0785 10.2775 0.3375 11.201 1.007 11.87C1.6795 12.5425 2.6 12.7985 3.526 12.841C4.166 12.87 4.3705 12.877 6 12.877C7.6295 12.877 7.834 12.87 8.474 12.841C9.401 12.7985 10.323 12.54 10.993 11.87C11.6665 11.1965 11.9215 10.278 11.964 9.35095C11.993 8.71095 12 8.50645 12 6.87695C12 5.24745 11.993 5.04295 11.964 4.40295C11.9215 3.47545 11.663 2.55395 10.993 1.88395C10.3215 1.21245 9.3985 0.954953 8.474 0.912953C7.834 0.883953 7.6295 0.876953 6 0.876953Z"
                                            fill="#D8BC59" />
                                        <path id="Vector_2"
                                            d="M5.99995 3.79596C4.29845 3.79596 2.91895 5.17546 2.91895 6.87696C2.91895 8.57846 4.29845 9.95796 5.99995 9.95796C7.70145 9.95796 9.08095 8.57846 9.08095 6.87696C9.08095 5.17546 7.70145 3.79596 5.99995 3.79596ZM5.99995 8.87696C4.89545 8.87696 3.99995 7.98146 3.99995 6.87696C3.99995 5.77246 4.89545 4.87696 5.99995 4.87696C7.10445 4.87696 7.99995 5.77246 7.99995 6.87696C7.99995 7.98146 7.10445 8.87696 5.99995 8.87696Z"
                                            fill="#D8BC59" />
                                        <path id="Vector_3"
                                            d="M9.20291 4.39395C9.60056 4.39395 9.92291 4.07159 9.92291 3.67395C9.92291 3.2763 9.60056 2.95395 9.20291 2.95395C8.80527 2.95395 8.48291 3.2763 8.48291 3.67395C8.48291 4.07159 8.80527 4.39395 9.20291 4.39395Z"
                                            fill="#D8BC59" />
                                    </g>
                                </g>
                                <defs>
                                    <clipPath id="clip0_220_4909">
                                        <rect width="12" height="12" fill="white" transform="translate(0 0.876953)" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </a>
                    </div>
                    <div class="w-12 flex items-center justify-center p-2 rounded-full border mt-6 border-yellow-500">
                        <a href="https://facebook.com/isfara.shoes">
                            <svg width="19" height="20" viewBox="0 0 12 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="facebook 1" clip-path="url(#clip0_220_4915)">
                                    <g id="Group">
                                        <path id="Vector"
                                            d="M12 6.91345C12 9.90795 9.803 12.3905 6.935 12.841V8.65945H8.3295L8.595 6.92945H6.935V5.80695C6.935 5.33345 7.167 4.87245 7.91 4.87245H8.6645V3.39945C8.6645 3.39945 7.9795 3.28245 7.325 3.28245C5.958 3.28245 5.065 4.11095 5.065 5.61045V6.92895H3.5455V8.65895H5.065V12.8405C2.1975 12.3895 0 9.90745 0 6.91345C0 3.59995 2.6865 0.913452 6 0.913452C9.3135 0.913452 12 3.59945 12 6.91345Z"
                                            fill="#D8BC59" />
                                    </g>
                                </g>
                                <defs>
                                    <clipPath id="clip0_220_4915">
                                        <rect width="12" height="12" fill="white" transform="translate(0 0.876953)" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </a>
                    </div>
                    <div class="w-12 flex items-center justify-center pr-1 py-2 rounded-full border mt-6 border-yellow-500">
                        <a href="https://t.me/BahridinTJ">
                            <svg width="19" height="20" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="Group">
                                    <g id="Group_2">
                                        <path id="Vector"
                                            d="M11.7734 0.568534C11.5687 0.394953 11.2472 0.370117 10.9148 0.503577H10.9142C10.5646 0.643861 1.01769 4.73883 0.62904 4.90613C0.558353 4.9307 -0.059004 5.16105 0.00458756 5.67415C0.061356 6.13675 0.557534 6.32835 0.618123 6.35045L3.04525 7.18151C3.20627 7.71754 3.79989 9.69515 3.93116 10.1176C4.01304 10.381 4.1465 10.7271 4.3804 10.7983C4.58564 10.8775 4.78979 10.8051 4.92188 10.7014L6.40578 9.32507L8.80124 11.1932L8.85828 11.2274C9.02095 11.2994 9.17679 11.3354 9.32553 11.3354C9.44043 11.3354 9.55069 11.3139 9.65604 11.2708C10.0149 11.1234 10.1585 10.7814 10.1735 10.7426L11.9628 1.44217C12.072 0.945443 11.9202 0.692715 11.7734 0.568534ZM5.1858 7.51393L4.36702 9.69734L3.54825 6.96808L9.82553 2.32836L5.1858 7.51393Z"
                                            fill="#D8BC59" />
                                    </g>
                                </g>
                            </svg>
                        </a>
                    </div>
                </div>
            </div>
            <div class="flex border-r-4 rounded-2xl border-black h-48 mx-5"></div>
            <div class="w-1/3  text-black text-md font-medium">
                <div class="flex flex-row my-2">
                    <span class="bg-primary hover:bg-black p-1 flex justify-center items-center rounded-full w-8 h-8">
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g id="phone">
                                <path id="Vector"
                                    d="M1.6001 2.39998C1.6001 2.1878 1.68438 1.98432 1.83441 1.83429C1.98444 1.68426 2.18792 1.59998 2.4001 1.59998H4.1225C4.31186 1.60006 4.49506 1.66732 4.63949 1.78978C4.78393 1.91225 4.88024 2.08197 4.9113 2.26878L5.5033 5.81678C5.53158 5.98575 5.50488 6.15934 5.42711 6.312C5.34934 6.46466 5.22462 6.58832 5.0713 6.66478L3.8329 7.28318C4.27698 8.3837 4.93836 9.3834 5.77752 10.2226C6.61667 11.0617 7.61638 11.7231 8.7169 12.1672L9.3361 10.9288C9.41251 10.7756 9.53605 10.651 9.68854 10.5732C9.84103 10.4955 10.0144 10.4687 10.1833 10.4968L13.7313 11.0888C13.9181 11.1198 14.0878 11.2161 14.2103 11.3606C14.3328 11.505 14.4 11.6882 14.4001 11.8776V13.6C14.4001 13.8121 14.3158 14.0156 14.1658 14.1657C14.0158 14.3157 13.8123 14.4 13.6001 14.4H12.0001C6.2561 14.4 1.6001 9.74397 1.6001 3.99998V2.39998Z"
                                    fill="white" />
                            </g>
                        </svg>
                    </span>
                    <div class="flex flex-col ml-2">
                        <h1>Телефон</h1>
                        <span class="text-gray-400 text-sm font-normal mt-1">+992 (92) 707-55-66</span>
                    </div>
                </div>
                <div class="flex flex-row my-2">
                    <span class="bg-primary hover:bg-black p-1 flex justify-center items-center rounded-full w-8 h-8">
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g id="home">
                                <path id="Vector"
                                    d="M8.56563 1.83439C8.41561 1.68441 8.21216 1.60016 8.00003 1.60016C7.7879 1.60016 7.58446 1.68441 7.43443 1.83439L1.83443 7.43439C1.68871 7.58527 1.60807 7.78735 1.60989 7.99711C1.61172 8.20687 1.69585 8.40752 1.84418 8.55584C1.9925 8.70417 2.19315 8.7883 2.40291 8.79013C2.61267 8.79195 2.81475 8.71131 2.96563 8.56559L3.20003 8.33119V13.6C3.20003 13.8122 3.28432 14.0156 3.43435 14.1657C3.58438 14.3157 3.78786 14.4 4.00003 14.4H5.60003C5.81221 14.4 6.01569 14.3157 6.16572 14.1657C6.31575 14.0156 6.40003 13.8122 6.40003 13.6V12C6.40003 11.7878 6.48432 11.5843 6.63435 11.4343C6.78438 11.2843 6.98786 11.2 7.20003 11.2H8.80003C9.01221 11.2 9.21569 11.2843 9.36572 11.4343C9.51575 11.5843 9.60003 11.7878 9.60003 12V13.6C9.60003 13.8122 9.68432 14.0156 9.83435 14.1657C9.98438 14.3157 10.1879 14.4 10.4 14.4H12C12.2122 14.4 12.4157 14.3157 12.5657 14.1657C12.7157 14.0156 12.8 13.8122 12.8 13.6V8.33119L13.0344 8.56559C13.1853 8.71131 13.3874 8.79195 13.5972 8.79013C13.8069 8.7883 14.0076 8.70417 14.1559 8.55584C14.3042 8.40752 14.3883 8.20687 14.3902 7.99711C14.392 7.78735 14.3114 7.58527 14.1656 7.43439L8.56563 1.83439Z"
                                    fill="white" />
                            </g>
                        </svg>
                    </span>
                    <div class="flex flex-col ml-2">
                        <h1>E-mail</h1>
                        <span class="text-gray-400 text-sm font-normal mt-1"><a
                                href="isfarashoes7@gmail.com">isfarashoes7@gmail.com</a></span>
                    </div>
                </div>
                <div class="flex flex-row my-2">
                    <span class="bg-primary hover:bg-black p-1 flex justify-center items-center rounded-full w-8 h-8">
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g id="mail">
                                <path id="Vector"
                                    d="M1.60254 4.70721L8.00014 7.90561L14.3977 4.70721C14.3741 4.29957 14.1954 3.9164 13.8984 3.63619C13.6014 3.35598 13.2085 3.19994 12.8001 3.20001H3.20014C2.79181 3.19994 2.3989 3.35598 2.10188 3.63619C1.80487 3.9164 1.62622 4.29957 1.60254 4.70721Z"
                                    fill="white" />
                                <path id="Vector_2"
                                    d="M14.4001 6.49438L8.0001 9.69438L1.6001 6.49438V11.2C1.6001 11.6243 1.76867 12.0313 2.06873 12.3314C2.36878 12.6314 2.77575 12.8 3.2001 12.8H12.8001C13.2244 12.8 13.6314 12.6314 13.9315 12.3314C14.2315 12.0313 14.4001 11.6243 14.4001 11.2V6.49438Z"
                                    fill="white" />
                            </g>
                        </svg>

                    </span>
                    <div class="flex flex-col ml-2">
                        <h1>Адрес</h1>
                        <span class="text-gray-400 text-sm font-normal mt-1">Таджикистан, г.Исфара, ул.А.Джураева 52 </span>
                    </div>
                </div>
            </div>
        </div>
        <!-- mob  -->
        <div class="xl:hidden lg:hidden flex flex-row text-md font-medium justify-between">
            <div class="w-1/2 ml-4 text-black">
                <div class="flex flex-row my-2.5">
                    <span class="bg-primary p-1 flex justify-center items-center rounded-full w-7 h-7">
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g id="phone">
                                <path id="Vector"
                                    d="M1.6001 2.39998C1.6001 2.1878 1.68438 1.98432 1.83441 1.83429C1.98444 1.68426 2.18792 1.59998 2.4001 1.59998H4.1225C4.31186 1.60006 4.49506 1.66732 4.63949 1.78978C4.78393 1.91225 4.88024 2.08197 4.9113 2.26878L5.5033 5.81678C5.53158 5.98575 5.50488 6.15934 5.42711 6.312C5.34934 6.46466 5.22462 6.58832 5.0713 6.66478L3.8329 7.28318C4.27698 8.3837 4.93836 9.3834 5.77752 10.2226C6.61667 11.0617 7.61638 11.7231 8.7169 12.1672L9.3361 10.9288C9.41251 10.7756 9.53605 10.651 9.68854 10.5732C9.84103 10.4955 10.0144 10.4687 10.1833 10.4968L13.7313 11.0888C13.9181 11.1198 14.0878 11.2161 14.2103 11.3606C14.3328 11.505 14.4 11.6882 14.4001 11.8776V13.6C14.4001 13.8121 14.3158 14.0156 14.1658 14.1657C14.0158 14.3157 13.8123 14.4 13.6001 14.4H12.0001C6.2561 14.4 1.6001 9.74397 1.6001 3.99998V2.39998Z"
                                    fill="white" />
                            </g>
                        </svg>
                    </span>
                    <div class="flex flex-col mt-2 ml-2">
                        <h1 class="text-xs">+992 (92) 707-55-66</h1>
                    </div>
                </div>
                <div class="flex flex-row my-2.5">
                    <span class="bg-primary p-1 flex justify-center items-center rounded-full w-7 h-7">
                        <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g id="mail">
                                <path id="Vector"
                                    d="M1.60254 4.70721L8.00014 7.90561L14.3977 4.70721C14.3741 4.29957 14.1954 3.9164 13.8984 3.63619C13.6014 3.35598 13.2085 3.19994 12.8001 3.20001H3.20014C2.79181 3.19994 2.3989 3.35598 2.10188 3.63619C1.80487 3.9164 1.62622 4.29957 1.60254 4.70721Z"
                                    fill="white" />
                                <path id="Vector_2"
                                    d="M14.4001 6.49438L8.0001 9.69438L1.6001 6.49438V11.2C1.6001 11.6243 1.76867 12.0313 2.06873 12.3314C2.36878 12.6314 2.77575 12.8 3.2001 12.8H12.8001C13.2244 12.8 13.6314 12.6314 13.9315 12.3314C14.2315 12.0313 14.4001 11.6243 14.4001 11.2V6.49438Z"
                                    fill="white" />
                            </g>
                        </svg>
                    </span>
                    <div class="flex flex-col mt-2 ml-2">
                        <h1 class="text-xs"><a href="isfarashoes7@gmail.com">isfarashoes7@gmail.com</a></h1>
                    </div>
                </div>
                <div class="flex flex-row my-2.5">
                    <span class="bg-primary p-1.5 flex justify-center items-center rounded-full w-7 h-7">
                        <svg width="18" height="18" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g id="home">
                                <path id="Vector"
                                    d="M8.56563 1.83439C8.41561 1.68441 8.21216 1.60016 8.00003 1.60016C7.7879 1.60016 7.58446 1.68441 7.43443 1.83439L1.83443 7.43439C1.68871 7.58527 1.60807 7.78735 1.60989 7.99711C1.61172 8.20687 1.69585 8.40752 1.84418 8.55584C1.9925 8.70417 2.19315 8.7883 2.40291 8.79013C2.61267 8.79195 2.81475 8.71131 2.96563 8.56559L3.20003 8.33119V13.6C3.20003 13.8122 3.28432 14.0156 3.43435 14.1657C3.58438 14.3157 3.78786 14.4 4.00003 14.4H5.60003C5.81221 14.4 6.01569 14.3157 6.16572 14.1657C6.31575 14.0156 6.40003 13.8122 6.40003 13.6V12C6.40003 11.7878 6.48432 11.5843 6.63435 11.4343C6.78438 11.2843 6.98786 11.2 7.20003 11.2H8.80003C9.01221 11.2 9.21569 11.2843 9.36572 11.4343C9.51575 11.5843 9.60003 11.7878 9.60003 12V13.6C9.60003 13.8122 9.68432 14.0156 9.83435 14.1657C9.98438 14.3157 10.1879 14.4 10.4 14.4H12C12.2122 14.4 12.4157 14.3157 12.5657 14.1657C12.7157 14.0156 12.8 13.8122 12.8 13.6V8.33119L13.0344 8.56559C13.1853 8.71131 13.3874 8.79195 13.5972 8.79013C13.8069 8.7883 14.0076 8.70417 14.1559 8.55584C14.3042 8.40752 14.3883 8.20687 14.3902 7.99711C14.392 7.78735 14.3114 7.58527 14.1656 7.43439L8.56563 1.83439Z"
                                    fill="white" />
                            </g>
                        </svg>
                    </span>
                    <div class="flex flex-col ml-2">
                        <h1 class="text-xs">Таджикистан, г.Исфара</h1>
                        <h1 class="text-xs">ул.А.Джураева 52</h1>
                    </div>
                </div>
            </div>
            <div class="flex border-r-4 rounded-2xl border-black h-32 mx-3"></div>
            <div class="w-1/2 mr-4">
                <div class="flex flex-col">
                    <div class="flex flex-row mt-1">
                        <span class="bg-primary m-1 pr-0.5 flex justify-center items-center rounded-full w-7 h-7">
                            <svg width="14" height="15" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="Group">
                                    <g id="Group_2">
                                        <path id="Vector"
                                            d="M11.7734 0.568534C11.5687 0.394953 11.2472 0.370117 10.9148 0.503577H10.9142C10.5646 0.643861 1.01769 4.73883 0.62904 4.90613C0.558353 4.9307 -0.059004 5.16105 0.00458756 5.67415C0.061356 6.13675 0.557534 6.32835 0.618123 6.35045L3.04525 7.18151C3.20627 7.71754 3.79989 9.69515 3.93116 10.1176C4.01304 10.381 4.1465 10.7271 4.3804 10.7983C4.58564 10.8775 4.78979 10.8051 4.92188 10.7014L6.40578 9.32507L8.80124 11.1932L8.85828 11.2274C9.02095 11.2994 9.17679 11.3354 9.32553 11.3354C9.44043 11.3354 9.55069 11.3139 9.65604 11.2708C10.0149 11.1234 10.1585 10.7814 10.1735 10.7426L11.9628 1.44217C12.072 0.945443 11.9202 0.692715 11.7734 0.568534ZM5.1858 7.51393L4.36702 9.69734L3.54825 6.96808L9.82553 2.32836L5.1858 7.51393Z"
                                            fill="white" />
                                    </g>
                                </g>
                            </svg>
                        </span>
                        <h1 class="mt-2 font-semibold text-sm"> <a href="https://t.me/BahridinTJ">Telegram</a></h1>
                    </div>
                    <div class="flex flex-row mt-1">
                        <span class="bg-primary m-1 p-1 flex justify-center items-center rounded-full w-7 h-7">
                            <svg width="14" height="15" viewBox="0 0 12 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="facebook 1" clip-path="url(#clip0_220_4915)">
                                    <g id="Group">
                                        <path id="Vector"
                                            d="M12 6.91345C12 9.90795 9.803 12.3905 6.935 12.841V8.65945H8.3295L8.595 6.92945H6.935V5.80695C6.935 5.33345 7.167 4.87245 7.91 4.87245H8.6645V3.39945C8.6645 3.39945 7.9795 3.28245 7.325 3.28245C5.958 3.28245 5.065 4.11095 5.065 5.61045V6.92895H3.5455V8.65895H5.065V12.8405C2.1975 12.3895 0 9.90745 0 6.91345C0 3.59995 2.6865 0.913452 6 0.913452C9.3135 0.913452 12 3.59945 12 6.91345Z"
                                            fill="white" />
                                    </g>
                                </g>
                                <defs>
                                    <clipPath id="clip0_220_4915">
                                        <rect width="12" height="12" fill="white" transform="translate(0 0.876953)" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </span>
                        <h1 class="mt-2 font-semibold text-sm"> <a href="https://facebook.com/isfara.shoes">
                                Facebook</a></h1>
                    </div>
                    <div class="flex flex-row mt-1">
                        <span class="bg-primary m-1 p-1 flex justify-center items-center rounded-full w-7 h-7">
                            <svg width="14" height="15" viewBox="0 0 12 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g id="instagram 1" clip-path="url(#clip0_220_4909)">
                                    <g id="Group">
                                        <path id="Vector"
                                            d="M6 1.95795C7.602 1.95795 7.792 1.96395 8.4245 1.99295C9.0785 2.02295 9.752 2.17195 10.2285 2.64845C10.7095 3.12945 10.854 3.79645 10.884 4.45245C10.913 5.08495 10.919 5.27495 10.919 6.87695C10.919 8.47895 10.913 8.66895 10.884 9.30145C10.8545 9.95195 10.702 10.632 10.2285 11.1055C9.7475 11.5865 9.081 11.731 8.4245 11.761C7.792 11.79 7.602 11.796 6 11.796C4.398 11.796 4.208 11.79 3.5755 11.761C2.93 11.7315 2.241 11.5755 1.7715 11.1055C1.293 10.627 1.146 9.95345 1.116 9.30145C1.087 8.66895 1.081 8.47895 1.081 6.87695C1.081 5.27495 1.087 5.08495 1.116 4.45245C1.1455 3.80445 1.2995 3.12045 1.7715 2.64845C2.2515 2.16845 2.921 2.02295 3.5755 1.99295C4.208 1.96395 4.398 1.95795 6 1.95795ZM6 0.876953C4.3705 0.876953 4.166 0.883953 3.526 0.912953C2.5985 0.955453 1.6775 1.21345 1.007 1.88395C0.334 2.55695 0.0785 3.47595 0.036 4.40295C0.007 5.04295 0 5.24745 0 6.87695C0 8.50645 0.007 8.71095 0.036 9.35095C0.0785 10.2775 0.3375 11.201 1.007 11.87C1.6795 12.5425 2.6 12.7985 3.526 12.841C4.166 12.87 4.3705 12.877 6 12.877C7.6295 12.877 7.834 12.87 8.474 12.841C9.401 12.7985 10.323 12.54 10.993 11.87C11.6665 11.1965 11.9215 10.278 11.964 9.35095C11.993 8.71095 12 8.50645 12 6.87695C12 5.24745 11.993 5.04295 11.964 4.40295C11.9215 3.47545 11.663 2.55395 10.993 1.88395C10.3215 1.21245 9.3985 0.954953 8.474 0.912953C7.834 0.883953 7.6295 0.876953 6 0.876953Z"
                                            fill="white" />
                                        <path id="Vector_2"
                                            d="M5.99995 3.79596C4.29845 3.79596 2.91895 5.17546 2.91895 6.87696C2.91895 8.57846 4.29845 9.95796 5.99995 9.95796C7.70145 9.95796 9.08095 8.57846 9.08095 6.87696C9.08095 5.17546 7.70145 3.79596 5.99995 3.79596ZM5.99995 8.87696C4.89545 8.87696 3.99995 7.98146 3.99995 6.87696C3.99995 5.77246 4.89545 4.87696 5.99995 4.87696C7.10445 4.87696 7.99995 5.77246 7.99995 6.87696C7.99995 7.98146 7.10445 8.87696 5.99995 8.87696Z"
                                            fill="white" />
                                        <path id="Vector_3"
                                            d="M9.20291 4.39395C9.60056 4.39395 9.92291 4.07159 9.92291 3.67395C9.92291 3.2763 9.60056 2.95395 9.20291 2.95395C8.80527 2.95395 8.48291 3.2763 8.48291 3.67395C8.48291 4.07159 8.80527 4.39395 9.20291 4.39395Z"
                                            fill="white" />
                                    </g>
                                </g>
                                <defs>
                                    <clipPath id="clip0_220_4909">
                                        <rect width="12" height="12" fill="white" transform="translate(0 0.876953)" />
                                    </clipPath>
                                </defs>
                            </svg>
                        </span>
                        <h1 class="mt-2 font-semibold text-sm"><a
                                href="https://instagram.com/poyafzol?igshid=OGQ5ZDc2ODk2ZA==">Instagram</a></h1>
                    </div>
                </div>
            </div>
        </div>
        <div class="xl:hidden lg:hidden flex w-full xl:ml-12 lg:ml-12 text-center mb-6 gap-6 text-gray-400 mt-2 flex-col">
            <p class="xl:flex lg:flex hidden xl:text-sm lg:text-sm">
                Данный сайт разработан в рамках проекта: «Активизация экономического восстановления от последствий
                пандемии
                COVID-19
                посредством улучшения благосостояния, возможностей для трудоустройства и продвижения регионального
                сотрудничества в
                ферганской долине» финансируемого Правительством Российской Федерации
            </p>
            <p style="font-size: 10px;" class="xl:hidden lg:hidden block mx-4 ">
                Данный сайт разработан в рамках проекта: «Активизация экономического восстановления от последствий
                пандемии
                COVID-19
                посредством улучшения благосостояния, возможностей для трудоустройства и продвижения регионального
                сотрудничества в
                ферганской долине» финансируемого Правительством Российской Федерации
            </p>
        </div>

        <!--  -->
    </div>
</template>

<script>
export default {
    name: 'the-footer',
    data() {
        return {

        }
    }
}
</script>
